#!/bin/bash
mongo --quiet << 'EOT'
//
// mongoはスクリプトのファイル入力ができないので
// この記述はmongo起動後コピペで実行すること 
//
use sampleDB
db.dropDatabase()
// 商品はprimary keyとして_id:ObjectId()を用いる
// public class 商品 {
//    private Map<String,String> _id;
//    public  String             商品id;
//    public  String             商品名;
//    public  String             商品分類;
//    public  int                販売単価;
//    public  int                仕入単価;
//    public  Map<String,Long>   登録日;
//    }
//  登録日は-９時間の時間差があることに注意
//db.商品.createIndex({商品id:1},{unique:true})
db.商品.insertMany([
   {商品id:'0001',商品名:'Tシャツ'       ,商品分類:'衣服'        ,販売単価:1000,仕入単価:500 ,登録日:ISODate("2020-08-01T03:06:11.000Z")}
  ,{商品id:'0002',商品名:'穴あけパンチ'  ,商品分類:'事務用品'    ,販売単価:500 ,仕入単価:320 ,登録日:ISODate("2020-08-02T03:06:20.000Z")}
  ,{商品id:'0003',商品名:'カッターシャツ',商品分類:'衣服'        ,販売単価:4000,仕入単価:2800,登録日:ISODate("2020-08-02T04:06:20.000Z")}
  ,{商品id:'0004',商品名:'包丁'          ,商品分類:'キッチン用品',販売単価:3000,仕入単価:2000,登録日:ISODate("2020-08-02T05:06:30.000Z")}
  ,{商品id:'0005',商品名:'フォーク'      ,商品分類:'キッチン用品',販売単価:500 ,仕入単価:300 ,登録日:ISODate("2020-08-03T03:06:40.000Z")}
  ,{商品id:'0006',商品名:'ステイプラー'  ,商品分類:'事務用品'    ,販売単価:880 ,仕入単価:500 ,登録日:ISODate("2020-08-03T04:06:50.000Z")}
  ,{商品id:'0007',商品名:'ボールペン'    ,商品分類:'事務用品'    ,販売単価:100 ,仕入単価:20  ,登録日:ISODate("2020-08-05T03:06:55.000Z")}
   ])
db.商品.find({},{_id:0})
//
// public class 店舗商品 {
//    private Map<String,String> _id;
//    public  String             店舗id;
//    public  String             店舗名;
//    public  String             商品id;
//    public  int                数量;
//    public  Map<String,Long>   更新日;
//    }
db.店舗商品.insertMany([
   {店舗id:'000A',店舗名:'東京'  ,商品id:'0001',数量:30 ,更新日:ISODate("2020-08-05T03:06:11.000Z")}
  ,{店舗id:'000A',店舗名:'東京'  ,商品id:'0002',数量:50 ,更新日:ISODate("2020-08-05T04:05:01.000Z")}
  ,{店舗id:'000A',店舗名:'東京'  ,商品id:'0003',数量:15 ,更新日:ISODate("2020-08-06T05:07:09.000Z")}
  ,{店舗id:'000B',店舗名:'名古屋',商品id:'0002',数量:30 ,更新日:ISODate("2020-08-06T03:08:30.000Z")}
  ,{店舗id:'000B',店舗名:'名古屋',商品id:'0003',数量:120,更新日:ISODate("2020-08-05T03:10:45.000Z")}
  ,{店舗id:'000B',店舗名:'名古屋',商品id:'0004',数量:20 ,更新日:ISODate("2020-08-10T03:11:10.000Z")}
  ,{店舗id:'000B',店舗名:'名古屋',商品id:'0006',数量:10 ,更新日:ISODate("2020-08-11T03:20:55.000Z")}
  ,{店舗id:'000B',店舗名:'名古屋',商品id:'0007',数量:40 ,更新日:ISODate("2020-08-03T03:18:26.000Z")}
  ,{店舗id:'000C',店舗名:'大阪'  ,商品id:'0003',数量:20 ,更新日:ISODate("2020-08-09T03:04:18.000Z")}
  ,{店舗id:'000C',店舗名:'大阪'  ,商品id:'0004',数量:50 ,更新日:ISODate("2020-08-11T03:45:31.000Z")}
  ,{店舗id:'000C',店舗名:'大阪'  ,商品id:'0006',数量:90 ,更新日:ISODate("2020-08-09T03:32:41.000Z")}
  ,{店舗id:'000C',店舗名:'大阪'  ,商品id:'0007',数量:70 ,更新日:ISODate("2020-08-06T03:23:20.000Z")}
  ,{店舗id:'000D',店舗名:'福岡'  ,商品id:'0001',数量:100,更新日:ISODate("2020-08-05T03:11:18.000Z")}
   ])
db.店舗商品.find({},{_id:0})
//
//
db.商品.find({商品分類:'キッチン用品'})
db.商品.find({商品分類:/用/})
EOT
